Revit 2027 API
Material.EmbodiedCarbonAssetId Property
 The ElementId of the embodied carbon PropertySetElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId EmbodiedCarbonAssetId { get; set; }
Public Property EmbodiedCarbonAssetId As ElementId
	Get
	Set
public:
property ElementId^ EmbodiedCarbonAssetId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member EmbodiedCarbonAssetId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace